RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_dsi.h
/* DSI_LPRXTO */
#define DSI_LPRXTO_LPRXTOCNT          BITS(0,23)          /*!< low power reception timeout counter */

/* DSI_TATO */
#define DSI_TATO_TATO                 BITS(0,5)           /*!< turn around timeout */

/* DSI_DEVRSTTM */
#define DSI_DEVRSTTM_DEVRTSTTM        BITS(0,15)          /*!< device reset timer */

/* DSI_DPIRES */
#define DSI_DPIRES_DPIRES             BITS(0,31)          /*!< DPI resolution */

/* DSI_DCSWC */
#define DSI_DCSWC_DCSWC               BITS(0,15)          /*!< DCS/Generic word count values need to be written before DCS or Generic long write */

/* DSI_HSACFG */
#define DSI_HSACFG_HSACNT             BITS(0,15)          /*!< horizontal sync active count */

/* DSI_HBPCFG */
#define DSI_HBPCFG_HBPCNT             BITS(0,15)          /*!< horizontal back porch count value */

/* DSI_HFPCFG */
#define DSI_HFPCFG_HFPCNT             BITS(0,15)          /*!< horizontal front porch count value */

/* DSI_HACFG */
#define DSI_HACFG_HACNT               BITS(0,15)          /*!< horizontal active area count,that is the time for active horizontal address */

/* DSI_VSACFG */
#define DSI_VSACFG_VSACNT             BITS(0,15)          /*!< vertical sync active count value */

/* DSI_VBPCFG */
#define DSI_VBPCFG_VBPCNT             BITS(0,15)          /*!< vertical back porch count value */

/* DSI_VFPCFG */
#define DSI_VFPCFG_VFPCNT             BITS(0,15)          /*!< vertical front porch count value */

/* DSI_DLCFG */
#define DSI_DLCFG_DLCFG               BITS(0,15)          /*!< switch count of HS to LP or LP to HS for data lane */

/* DSI_DPICTL */
#define DSI_DPICTL_SD                 BIT(0)              /*!< shut down(0x01) command is packetized for the DPI's virtual channel */
#define DSI_DPICTL_TON                BIT(1)              /*!< turn ON (0x02) command is packetized for the DPI's virtual channel */
#define DSI_DPICTL_CMON               BIT(2)              /*!< color mode ON(0x04) command is packetized for the DPI's virtual channel */
#define DSI_DPICTL_CMOFF              BIT(3)              /*!< color mode OFF(0x08) command is packetized for the DPI's virtual channel */

/* DSI_DPHY_PLLLK */
#define DSI_DPHY_PLLLK_PLLCNTVAL      BITS(0,15)          /*!< PLL counter value in terms of low power clock */

/* DSI_INITCFG */
#define DSI_INITCFG_INITCNT           BITS(0,15)          /*!< counter value in terms of low power clock to initialize the DSI Host IP that drives a stop state on the mipi's D-PHY bus */

/* DSI_MAXRPKTCTL */
#define DSI_MAXRPKTCTL_MAXRPKTSZ      BITS(0,10)          /*!< maximum return packet size in bytes */
#define DSI_MAXRPKTCTL_HS_LP          BIT(15)             /*!< indicates the data transfer type */

/* DSI_VMFMT */
#define DSI_VMFMT_VMFMT               BITS(0,1)           /*!< video mode format */

/* DSI_CKEOTCTL */
#define DSI_CKEOTCTL_EOTDIS           BIT(0)              /*!< disable EOT packet(EoTp) transmission */
#define DSI_CKEOTCTL_CKSTOP           BIT(1)              /*!< enable clock stopping feature */
#define DSI_CKEOTCTL_VBTADIS          BIT(2)              /*!< disable video BTA */

/* DSI_PLCTL */
#define DSI_PLCTL_PL                  BITS(0,3)           /*!< polarity */

/* DSI_CKLSWCFG */
#define DSI_CKLSWCFG_HSLPSW           BITS(0,15)          /*!< HS to LP switching counter for clock lane */
#define DSI_CKLSWCFG_LPHSSW           BITS(16,31)         /*!< LP to HS switching counter for clock lane */

/* DSI_LPBCLKCFG */
#define DSI_LPBCLKCFG_LPBYTECLK       BITS(0,15)          /*!< LP clock equivalence in terms of byte clock */

/* DSI_DPHY_PCFG */
#define DSI_DPHY_PCFG_HS_PREP         BITS(0,7)           /*!< HS preparation time(THS-PREPARE) */
#define DSI_DPHY_PCFG_HS_ZERO         BITS(8,15)          /*!< HS drive zero time(THS-ZERO) */
#define DSI_DPHY_PCFG_HS_TRAIL        BITS(16,23)         /*!< HS trail time(THS-TRAIL) */
#define DSI_DPHY_PCFG_HS_EXIT         BITS(24,31)         /*!< HS exit time(THS-EXIT) */

/* DSI_DPHY_CLTMPCFG */
#define DSI_DPHY_CLTMPCFG_CLK_PREP    BITS(0,7)           /*!< CLK preparation time(TCLK-PREPARE) */
#define DSI_DPHY_CLTMPCFG_CLK_ZERO    BITS(8,15)          /*!< CLK drive zero time(TCLK-ZERO) */
#define DSI_DPHY_CLTMPCFG_CLK_TRAIL   BITS(16,23)         /*!< CLK trail time(TCLK-TRAIL) */
#define DSI_DPHY_CLTMPCFG_CLK_EXIT    BITS(24,31)         /*!< CLK exit time(TCLK-EXIT) */

/* DSI_DPHY_RSTENDFE */
#define DSI_DPHY_RSTENDFE_RSTENDFE    BIT(0)              /*!< reset (enable) to the digital front end(DFE) */

/* DSI_DPHY_TRIMCTL0 */
#define DSI_DPHY_TRIMCTL0_TRIM_FF_BYPASS            BIT(0)              /*!< used to bypass the LPTX signals sampling done by the reference clock */
#define DSI_DPHY_TRIMCTL0_TRIM_FF_BYPASSC           BIT(1)              /*!< used to bypass the LPTX signals sampling done by the reference clock */
#define DSI_DPHY_TRIMCTL0_TRIM_LP_SLEWRATE          BITS(2,3)           /*!< adjust the LP transmit signal slew rate */
#define DSI_DPHY_TRIMCTL0_TX_HS_DRV                 BITS(4,5)           /*!< adjust the HS driver impedance */
#define DSI_DPHY_TRIMCTL0_TX_HS_SLEW                BITS(6,7)           /*!< adjust the HS transmit signal slew rate */
#define DSI_DPHY_TRIMCTL0_TX_BCLK_POL_SEL           BIT(8)              /*!< select the TX byte clock polarity */
#define DSI_DPHY_TRIMCTL0_LP_DC_TEST_EN             BIT(9)              /*!< enable LP transmitter DC test */
#define DSI_DPHY_TRIMCTL0_HS_DC_TEST_EN             BIT(10)             /*!< enable HS transmitter DC test */
#define DSI_DPHY_TRIMCTL0_DC_TEST_DATA              BIT(11)             /*!< LP or HS data to transmit out when anyone of the DC test is enabled */
#define DSI_DPHY_TRIMCTL0_VBG_SEL                   BIT(12)             /*!< select the PVT independent bandgap voltage */
#define DSI_DPHY_TRIMCTL0_BG_TRIM                   BITS(13,14)         /*!< adjust bandgap reference voltage */
#define DSI_DPHY_TRIMCTL0_CD_HIGH_750MV_TRIM        BITS(15,16)         /*!< adjust CD reference high voltage */
#define DSI_DPHY_TRIMCTL0_CD_LOW_325MV_TRIM         BITS(17,18)         /*!< adjust CD reference low voltage */
#define DSI_DPHY_TRIMCTL0_LP_LDO_REF_725MV_TRIM     BITS(19,20)         /*!< adjust LP LDO reference voltage */
#define DSI_DPHY_TRIMCTL0_LPRX_REF_650MV_TRIM       BITS(21,22)         /*!< adjust LP RX reference voltage */
#define DSI_DPHY_TRIMCTL0_PLL_CP_LDO_900MV_TRIM     BITS(23,24)         /*!< adjust PLL CP LDO reference voltage */
#define DSI_DPHY_TRIMCTL0_TX_PREDRV_REF_400MV_TRIM  BITS(25,26)         /*!< adjust HS TX pre-driver LDO reference voltage */
#define DSI_DPHY_TRIMCTL0_TX_VMD_REF_400MV_TRIM     BITS(27,29)         /*!< adjust HS TX common mode voltage */
#define DSI_DPHY_TRIMCTL0_LPLDOPD_IN                BIT(30)             /*!< external LP LDO power down */
#define DSI_DPHY_TRIMCTL0_LPLDOPD_SEL               BIT(31)             /*!< LP LDO power down selection */

/* DSI_DPHY_TRIMCTL1 */
#define DSI_DPHY_TRIMCTL1_CNTB                      BIT(0)              /*!< reference CNTA[5:0] */
#define DSI_DPHY_TRIMCTL1_CNTA                      BITS(1,6)           /*!< PLL divider ratio used in counter */
#define DSI_DPHY_TRIMCTL1_EXT_RSTB_EN               BIT(7)              /*!< enable external active-low reset */
#define DSI_DPHY_TRIMCTL1_EXT_RSTB                  BIT(8)              /*!< external active-low reset */
#define DSI_DPHY_TRIMCTL1_RES                       BITS(9,11)          /*!< LPF resistor selection */
#define DSI_DPHY_TRIMCTL1_BW_RES_SEL                BIT(12)             /*!< PLL LPF resistor selection */
#define DSI_DPHY_TRIMCTL1_PLL_STCKSEL               BITS(13,14)         /*!< control to select a clock from PLL to test */
#define DSI_DPHY_TRIMCTL1_TSTODBY4                  BIT(15)             /*!< control to select clock DIvide by 4 or clock divide by 8 as output */
#define DSI_DPHY_TRIMCTL1_REFCLK_DLY                BITS(16,17)         /*!< programmable escape clock delay in AFE to capture the LP data driven by the DFE */
#define DSI_DPHY_TRIMCTL1_BYPASS_LPTX_PU_LOGIC      BIT(18)             /*!< LP11 initialization bypass signal for data lanes */
#define DSI_DPHY_TRIMCTL1_BYPASS_LPTX_PU_LOGIC_CK   BIT(19)             /*!< LP11 initialization bypass signal for clock lane */
#define DSI_DPHY_TRIMCTL1_CDPD0                     BIT(20)             /*!< contention detection block power down signal */
#define DSI_DPHY_TRIMCTL1_RXLANE_POLARITY_SWAP0     BIT(21)             /*!< control to swap the polarity of the RX output */
#define DSI_DPHY_TRIMCTL1_LPRX_GLITCH_FILT_BYPASS   BIT(22)             /*!< LPXOR clock glitch filter bypass enable */
#define DSI_DPHY_TRIMCTL1_LPXORCLK_DLY              BITS(23,24)         /*!< programmable delay in LP XOR clock */
#define DSI_DPHY_TRIMCTL1_PLL_CP_CT_TRIM            BITS(25,26)         /*!< programmable PLL charge pump current */
#define DSI_DPHY_TRIMCTL1_PLL_SUPPLY_SEL            BIT(27)             /*!< PLL CP supply voltage selection */
#define DSI_DPHY_TRIMCTL1_TRIM_DIS_ULPS_LP00        BIT(28)             /*!< disable weak pull-down resistor added in mipi data lanes */
#define DSI_DPHY_TRIMCTL1_TRIM_DIS_ULPS_LP00_CK     BIT(29)             /*!< disable weak pull-down resistor added in mipi clock lane */
#define DSI_DPHY_TRIMCTL1_TRIM_AFE_OFF_ULPS         BIT(30)             /*!< enable to power off all AFE blocks in ULPS */
#define DSI_DPHY_TRIMCTL1_ESCAPE_CLK_SEL            BIT(31)             /*!< it is used to select the reference clock */

/* DSI_DPHY_TRIMCTL2 */
#define DSI_DPHY_TRIMCTL2_TRIM_LPRX_BYPASS_EN       BIT(0)              /*!< control to overwrite LP RX enable */
#define DSI_DPHY_TRIMCTL2_TRIM_LPRX_D0              BIT(1)              /*!< control to overwrite LP RX data */
#define DSI_DPHY_TRIMCTL2_TRIM_HSTX_BYPASS_EN       BIT(2)              /*!< control to overwrite HS TX enable */
#define DSI_DPHY_TRIMCTL2_TRIM_HSTX_CK              BIT(3)              /*!< control to overwrite HS TX data of clock lane */
#define DSI_DPHY_TRIMCTL2_TRIM_HSTX_D0              BIT(4)              /*!< control to overwrite HS TX data of data lane0 */
#define DSI_DPHY_TRIMCTL2_TRIM_HSTX_D1              BIT(5)              /*!< control to overwrite HS TX data of data lane1 */
#define DSI_DPHY_TRIMCTL2_TRIM_LPTX_BYPASS_EN       BIT(6)              /*!< control to overwrite LP TX enable */
#define DSI_DPHY_TRIMCTL2_TRIM_LPTX_CK              BIT(7)              /*!< control to overwrite LP TX data of clock lane */
#define DSI_DPHY_TRIMCTL2_TRIM_LPTX_D0              BIT(8)              /*!< control to overwrite LP TX data of data lane0 */
#define DSI_DPHY_TRIMCTL2_TRIM_LPTX_D1              BIT(9)              /*!< control to overwrite LP TX data of data lane1 */
#define DSI_DPHY_TRIMCTL2_SYS_RESET_N_INT           BIT(17)             /*!< optional system reset signal */
#define DSI_DPHY_TRIMCTL2_LANE0_EN                  BIT(18)             /*!< lane enable control for lane0 */
#define DSI_DPHY_TRIMCTL2_LANE1_EN                  BIT(19)             /*!< lane enable control for lane1 */
#define DSI_DPHY_TRIMCTL2_DPHY_MUX_CFG              BIT(20)             /*!< lane swap configuration bit */
#define DSI_DPHY_TRIMCTL2_PSWP0                     BIT(21)             /*!< data lane 0 polarity swap enable */
#define DSI_DPHY_TRIMCTL2_PSWP1                     BIT(22)             /*!< data lane 1 polarity swap enable */
#define DSI_DPHY_TRIMCTL2_CPSWP                     BIT(23)             /*!< clock lane polarity swap enable */
#define DSI_DPHY_TRIMCTL2_V2IPD                     BIT(24)             /*!< force bias circuits power down if PDR is set 1 */
#define DSI_DPHY_TRIMCTL2_BGPD                      BIT(25)             /*!< force bandgap circuits power down if PDR is set 1 */
#define DSI_DPHY_TRIMCTL2_HSTX_LDO_PD               BIT(26)             /*!< force high speed driver LDO circuits power down */
#define DSI_DPHY_TRIMCTL2_PLLPD                     BIT(27)             /*!< force PLL circuits power down if PDR is set 1 */
#define DSI_DPHY_TRIMCTL2_TRIM_PLL_LOCK             BIT(28)             /*!< force PLL lock detect high */
#define DSI_DPHY_TRIMCTL2_PDR                       BIT(29)             /*!< power down control */

