RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_dsi.h
/* DSI_DSKCTL */
#define DSI_DSKCTL_DSKCALIB              BITS(0,1)           /*!< deskew calibration */
#define DSI_DSKCTL_DSKDUR                BITS(2,17)          /*!< deskew duration */

/* DSI_DSKTM */
#define DSI_DSKTM_DSKTM                  BITS(0,15)          /*!< periodic deskew timer */

/* DSI_DSKSTAT */
#define DSI_DSKSTAT_DSKIP                BIT(0)              /*!< deskew calibration is in progress */

/* DSI_EARCTL */
#define DSI_EARCTL_ECC_MUL_ERR_CLR       BIT(0)              /*!< ecc_mul_err_clr error recovery action is taken immediately by DSI TX */
#define DSI_EARCTL_INVLD_DT_CLR          BIT(1)              /*!< invld_dt_clr error recovery action is taken immediately by DSI TX */
#define DSI_EARCTL_HI_CONT_CLR           BIT(2)              /*!< hi_cont_clr error recovery action is taken immediately by DSI TX */
#define DSI_EARCTL_LO_CONT_CLR           BIT(3)              /*!< lo_cont_clr error recovery action is taken immediately by DSI TX */
#define DSI_EARCTL_HS_RX_TO_CLR          BIT(4)              /*!< hs_rx_timeout_clr error recovery action is taken immediately by DSI TX */
#define DSI_EARCTL_LP_RX_TO_CLR          BIT(5)              /*!< lp_rx_timeout_clr error recovery action is taken immediately by DSI TX */

/* DSI_MIPIDIRDPISTAT */
#define DSI_MIPIDIRDPISTAT_MIPI_DIR      BIT(0)              /*!< MIPI bus direction */
#define DSI_MIPIDIRDPISTAT_DPI_HI        BIT(15)             /*!< DPI line time is greater or DSI line time is greater */
#define DSI_MIPIDIRDPISTAT_DPI_DIFF      BITS(16,31)         /*!< the difference in one line time between DPI and DSI */

/* DSI_PLSWAP */
#define DSI_PLSWAP_VSPL                  BIT(0)              /*!< vsync polarity */
#define DSI_PLSWAP_HSPL                  BIT(1)              /*!< hsync polarity */
#define DSI_PLSWAP_SDPL                  BIT(2)              /*!< shutdown polarity */
#define DSI_PLSWAP_CMPL                  BIT(3)              /*!< color mode polarity */

/* DSI_FMCTL */
#define DSI_FMCTL_FREQMOD                BIT(0)              /*!< frequency mode */

/* DSI_TXDTWCFG */
#define DSI_TXDTWCFG_TXDTWIDTH           BITS(0,7)           /*!< Tx data width hs */

/* DSI_LPCTL */
#define DSI_LPCTL_DTTYPE                 BITS(0,5)           /*!< data type */
#define DSI_LPCTL_VCH                    BITS(6,7)           /*!< virtual channel */
#define DSI_LPCTL_WORDCNT                BITS(8,23)          /*!< word count */

/* DSI_LPDATA */
#define DSI_LPDATA_LPDATA                BITS(0,31)          /*!< data used for Generic/ DCS data transfers in low power mode */

/* DSI_HSCTL */
#define DSI_HSCTL_DTTYPE                 BITS(0,5)           /*!< data type */
#define DSI_HSCTL_VCH                    BITS(6,7)           /*!< virtual channel */
#define DSI_HSCTL_WORDCNT                BITS(8,23)          /*!< word count */

/* DSI_HSDATA */
#define DSI_HSDATA_HSDATA                BITS(0,31)          /*!< data used for Generic/ DCS data transfers in high-speed mode */

/* DSI_FIFOSTAT */
#define DSI_FIFOSTAT_HSDTFIFOF           BIT(0)              /*!< HS Generic/DCS data FIFO full */
#define DSI_FIFOSTAT_HSDTFIFOHE          BIT(1)              /*!< HS Generic/DCS data FIFO half empty */
#define DSI_FIFOSTAT_HSDTFIFOE           BIT(2)              /*!< HS Generic/DCS data FIFO empty */
#define DSI_FIFOSTAT_LPDTFIFOF           BIT(8)              /*!< LP Generic/DCS data FIFO full */
#define DSI_FIFOSTAT_LPDTFIFOHE          BIT(9)              /*!< LP Generic/DCS data FIFO half empty */
#define DSI_FIFOSTAT_LPDTFIFOE           BIT(10)             /*!< LP Generic/DCS data FIFO empty */
#define DSI_FIFOSTAT_HSCTLFIFOF          BIT(16)             /*!< HS Generic/DCS control FIFO full */
#define DSI_FIFOSTAT_HSCTLFIFOHE         BIT(17)             /*!< HS Generic/DCS control FIFO half empty */
#define DSI_FIFOSTAT_HSCTLFIFOE          BIT(18)             /*!< HS Generic/DCS control FIFO empty */
#define DSI_FIFOSTAT_LPCTLFIFOF          BIT(24)             /*!< LP Generic/DCS control FIFO full */
#define DSI_FIFOSTAT_LPCTLFIFOHE         BIT(25)             /*!< LP Generic/DCS control FIFO half empty */
#define DSI_FIFOSTAT_LPCTLFIFOE          BIT(26)             /*!< LP Generic/DCS control FIFO empty */

/* DSI_INTSTAT1 */
#define DSI_INTSTAT1_HSDTFIFOFIF         BIT(0)              /*!< HS Generic/DCS data FIFO full */
#define DSI_INTSTAT1_LPDTFIFOFIF         BIT(1)              /*!< LP Generic/DCS data FIFO full */
#define DSI_INTSTAT1_LPCTLFIFOFIF        BIT(2)              /*!< LP Generic/DCS control FIFO full */
#define DSI_INTSTAT1_HSCTLFIFOFIF        BIT(3)              /*!< HS Generic/DCS control FIFO full */
#define DSI_INTSTAT1_RDDTAIF             BIT(4)              /*!< LP Generic/DCS read data available */
#define DSI_INTSTAT1_TETGIF              BIT(5)              /*!< tearing effect(TE) trigger message received */

/* DSI_WCTL */
#define DSI_WCTL_TEPOL                   BIT(3)              /*!< TE pin polarity */
#define DSI_WCTL_TLIDMA                  BIT(4)              /*!< TLI DMA mode */
#define DSI_WCTL_TESRC                   BIT(5)              /*!< tearing effect (TE) source */
#define DSI_WCTL_ARM                     BIT(6)              /*!< automatic refresh mode */
#define DSI_WCTL_RBUF                    BIT(7)              /*!< refresh cmd fifo buffer */
#define DSI_WCTL_ARBUF                   BIT(8)              /*!< hardware auto refresh cmd fifo buffer enable */

/* DSI_WINTEN */
#define DSI_WINTEN_TEIE                  BIT(0)              /*!< tearing effect interrupt enable */
#define DSI_WINTEN_PLLLKIE               BIT(1)              /*!< PLL lock interrupt enable */
#define DSI_WINTEN_PLLULKIE              BIT(2)              /*!< PLL unlock interrupt enable */

/* DSI_WINTSTAT */
#define DSI_WINTSTAT_TEIF                BIT(0)              /*!< tearing effect interrupt flag */
#define DSI_WINTSTAT_PLLLKIF             BIT(1)              /*!< PLL lock interrupt flag */
#define DSI_WINTSTAT_PLLULKIF            BIT(2)              /*!< PLL unlock interrupt flag */
#define DSI_WINTSTAT_PLLLKS              BIT(3)              /*!< PLL lock status */

/* DSI_WINTC */
#define DSI_WINTC_TEIC                   BIT(0)              /*!< tearing effect interrupt flag clear */
#define DSI_WINTC_PLLLKIC                BIT(1)              /*!< PLL lock interrupt flag clear */
#define DSI_WINTC_PLLULKIC               BIT(2)              /*!< PLL unlock interrupt flag clear */

/* DSI_WRGBDF */
#define DSI_WRGBDF_TLI_DF                BITS(0,2)           /*!< TLI data format select */

/* DSI_WCMDDS */
#define DSI_WCMDDS_HSCMDDS               BIT(0)              /*!< command mode high speed fifo write data source */
#define DSI_WCMDDS_LPCMDDS               BIT(1)              /*!< command mode low power fifo write data source */

