RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_dsi.h
/* FIFO status */
#define DSI_DATA_FIFO_STAT_HS_FULL         DSI_FIFOSTAT_HSDTFIFOF                /*!< HS Generic/DCS data FIFO full */
#define DSI_DATA_FIFO_STAT_HS_HALF_EMPTY   DSI_FIFOSTAT_HSDTFIFOHE               /*!< HS Generic/DCS data FIFO half empty */
#define DSI_DATA_FIFO_STAT_HS_EMPTY        DSI_FIFOSTAT_HSDTFIFOE                /*!< HS Generic/DCS data FIFO empty */
#define DSI_DATA_FIFO_STAT_LP_FULL         DSI_FIFOSTAT_LPDTFIFOF                /*!< LP Generic/DCS data FIFO full */
#define DSI_DATA_FIFO_STAT_LP_HALF_EMPTY   DSI_FIFOSTAT_LPDTFIFOHE               /*!< LP Generic/DCS data FIFO half empty */
#define DSI_DATA_FIFO_STAT_LP_EMPTY        DSI_FIFOSTAT_LPDTFIFOE                /*!< LP Generic/DCS data FIFO empty */
#define DSI_CTRL_FIFO_STAT_HS_FULL         DSI_FIFOSTAT_HSCTLFIFOF               /*!< HS Generic/DCS control FIFO full */
#define DSI_CTRL_FIFO_STAT_HS_HALF_EMPTY   DSI_FIFOSTAT_HSCTLFIFOHE              /*!< HS Generic/DCS control FIFO half empty */
#define DSI_CTRL_FIFO_STAT_HS_EMPTY        DSI_FIFOSTAT_HSCTLFIFOE               /*!< HS Generic/DCS control FIFO empty */
#define DSI_CTRL_FIFO_STAT_LP_FULL         DSI_FIFOSTAT_LPCTLFIFOF               /*!< LP Generic/DCS control FIFO full */
#define DSI_CTRL_FIFO_STAT_LP_HALF_EMPTY   DSI_FIFOSTAT_LPCTLFIFOHE              /*!< LP Generic/DCS control FIFO half empty */
#define DSI_CTRL_FIFO_STAT_LP_EMPTY        DSI_FIFOSTAT_LPCTLFIFOE               /*!< LP Generic/DCS control FIFO empty */

/* wrapper hardware auto refresh cmd FIFO buffer enable */
#define DSI_AUTO_REFRESH_BUF_DISABLE       0x00000000U                           /*!< No auto-refresh of cmd FIFO */
#define DSI_AUTO_REFRESH_BUF_ENABLE        DSI_WCTL_ARBUF                        /*!< Auto-refresh cmd FIFO */

/* wrapper automatic refresh mode */
#define DSI_AUTO_REFRESH_MODE_DISABLE      0x00000000U                           /*!< Automatic refresh mode disable */
#define DSI_AUTO_REFRESH_MODE_ENABLE       DSI_WCTL_ARM                          /*!< Automatic refresh mode enable */

/* wrapper DMA request source select */
#define DSI_REQDMASRC(regval)              (BITS(4,6) & ((uint32_t)(regval) << 4))
#define DSI_DMA_REQ_SRC_HSDTFIFOHE         DSI_REQDMASRC(0)                      /*!< DMA request source select HSDTFIFOHE */
#define DSI_DMA_REQ_SRC_HSDTFIFOE          DSI_REQDMASRC(1)                      /*!< DMA request source select HSDTFIFOE */
#define DSI_DMA_REQ_SRC_HSDTFIFOF_INV      DSI_REQDMASRC(2)                      /*!< DMA request source select ~HSDTFIFOF */
#define DSI_DMA_REQ_SRC_LPDTFIFOHE         DSI_REQDMASRC(4)                      /*!< DMA request source select LPDTFIFOHE */
#define DSI_DMA_REQ_SRC_LPDTFIFOE          DSI_REQDMASRC(5)                      /*!< DMA request source select LPDTFIFOE */
#define DSI_DMA_REQ_SRC_LPDTFIFOF_INV      DSI_REQDMASRC(6)                      /*!< DMA request source select ~LPDTFIFOF */

/* video mode format */
#define DSI_VMFMT_VMFMT_SEL(regval)        (BITS(0,1) & ((uint32_t)(regval)))
#define DSI_VIDEO_MODE_FORMAT_NONE         DSI_VMFMT_VMFMT_SEL(0)                /*!< none video mode format */
#define DSI_NON_BURST_MODE_SYNC_PULSE      DSI_VMFMT_VMFMT_SEL(1)                /*!< non burst mode with sync pulse */
#define DSI_NON_BURST_MODE_SYNC_EVENTS     DSI_VMFMT_VMFMT_SEL(2)                /*!< non burst mode with sync events */
#define DSI_BURST_MODE                     DSI_VMFMT_VMFMT_SEL(3)                /*!< burst mode */

/* structure definitions */
/* DSI DPHY parameter configuration structure */
typedef struct {
    uint8_t hs_prepare;                /*!< HS preparation time (THS-PREPARE) */
    uint8_t hs_zero;                   /*!< HS drive zero time (THS-ZERO) */
    uint8_t hs_trail;                  /*!< HS trail time (THS-TRAIL) */
    uint8_t hs_exit;                   /*!< HS exit time (THS-EXIT) */
    uint8_t clk_prepare;               /*!< CLK preparation time (TCLK-PREPARE) */
    uint8_t clk_zero;                  /*!< CLK drive zero time (TCLK-ZERO) */
    uint8_t clk_trail;                 /*!< CLK trail time (TCLK-TRAIL) */
    uint8_t clk_exit;                  /*!< CLK exit time (TCLK-EXIT) */
} dsi_dphy_parameter_struct;

/* DSI timing parameters structure */
typedef struct {
    uint16_t hs_to_count;              /*!< high-speed transmission timeout counter */
    uint32_t lp_rx_to_count;           /*!< low-power reception timeout counter */
    uint8_t ta_to_count;               /*!< turn-around timeout counter */
    uint8_t dphy_pll_count;                 /*!< DPhy PLL counter */
    uint16_t dbi_to_count;             /*!< DBI interface timeout counter */
    uint16_t lp_bcm_count;             /*!< low-power byte clock mode counter */
    uint16_t hs_switch_count;          /*!< HS to LP and LP to HS switch count */
    uint16_t clk_hs_lp_switch_count;   /*!< clock lane HS to LP switch count */
    uint16_t clk_lp_hs_switch_count;   /*!< clock lane LP to HS switch count */
    uint16_t init_count;               /*!< DPHY initialization counter */
} dsi_timing_parameter_struct;

/* DSI initialization structure */
typedef struct {
    uint32_t lane_count;               /*!< number of active data lanes */
    dsi_mode_enum mode_type;           /*!< mode type, video mode or command mode */
    uint32_t video_mode_format;        /*!< video mode format for video mode */
    uint32_t color_format;             /*!< color format for video mode */
    uint32_t data_width;               /*!< data width for command mode */
    uint32_t cmd_size;                 /*!< DSI command size */
    uint32_t virtual_channel;          /*!< virtual channel ID */
    uint32_t polarity;                 /*!< polarity configuration */
} dsi_init_parameter_struct;

/* DSI timing parameters structure */
typedef struct {
    uint16_t hsa_count;                /*!< horizontal sync active count */
    uint16_t hbp_count;                /*!< horizontal back porch count */
    uint16_t hfp_count;                /*!< horizontal front porch count */
    uint16_t hac_count;                /*!< horizontal active count */
    uint16_t vsa_count;                /*!< vertical sync active count */
    uint16_t vbp_count;                /*!< vertical back porch count */
    uint16_t vfp_count;                /*!< vertical front porch count */
} dsi_hv_count_struct;

/* DSI WMS parameters structure */
typedef struct {
    uint32_t wms_mode;                 /*!< WMS mode */
    uint8_t first_packet_header;       /*!< first split packet head */
    uint8_t second_packet_header;      /*!< secondary split packet head */
    uint8_t dcs_command;               /*!< long packet DCS command */
    uint8_t packet_length;             /*!< packet length in words */
    uint32_t total_length;             /*!< total number of words to be transferred */
} dsi_wms_parameter_struct;

