RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_dsi.h
/* enumerations definitions */
/* DSI command list definitions */
typedef enum {
    DSI_CMD_SHUT_DOWN             = DSI_DPICTL_SD,       /*!< DPI shutdown (0x01) command */
    DSI_CMD_TURN_ON               = DSI_DPICTL_TON,      /*!< DPI turn on (0x02) command */
    DSI_CMD_COLOR_MODE_ON         = DSI_DPICTL_CMON,     /*!< color mode on (0x04) command */
    DSI_CMD_COLOR_MODE_OFF        = DSI_DPICTL_CMOFF     /*!< color mode off (0x08) command */
} dsi_command_enum;

/* register offset */
#define DSI_INTSTAT0_REG_OFFSET           0x00000004U    /*!< INTSTAT0 register offset */
#define DSI_INTEN_REG_OFFSET              0x00000008U    /*!< INTEN register offset */
#define DSI_WCTL_REG_OFFSET               0x00000200U    /*!< WCTL register offset */
#define DSI_WINTEN_REG_OFFSET             0x00000204U    /*!< WINTEN register offset */
#define DSI_WINTSTAT_REG_OFFSET           0x00000208U    /*!< WINTSTAT register offset */
#define DSI_WWMS_WCTL_REG_OFFSET          0x00000230U    /*!< WWMS_WCTL register offset */
#define DSI_WWMS_INTMSK_REG_OFFSET        0x00000234U    /*!< WWMS_INTMSK register offset */

/* DSI flags */
typedef enum {
    /* flags in INTSTAT0 register */
    DSI_FLAG_RXSOTE     = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 0U),        /*!< Rx Sot Error flag */
    DSI_FLAG_RXSOTSYNCE = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 1U),        /*!< Rx Sot Sync Error flag */
    DSI_FLAG_RXEOTSYNCE = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 2U),        /*!< Rx Eot sync Error flag */
    DSI_FLAG_RXESCMEE   = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 3U),        /*!< Rx Escape Mode Entry Error flag */
    DSI_FLAG_RXLPTXSYNCE = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 4U),       /*!< Rx LP tx sync error flag */
    DSI_FLAG_RXPTOE     = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 5U),        /*!< Rx Peripheral timeout Error flag */
    DSI_FLAG_RXFCTLE    = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 6U),        /*!< Rx False Control Error flag */
    DSI_FLAG_RXECCSE    = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 7U),        /*!< Rx ECC single bit error flag */
    DSI_FLAG_RXECCME    = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 8U),        /*!< Rx ECC multi-bit error flag */
    DSI_FLAG_RXCHKE     = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 9U),        /*!< Rx checksum error flag */
    DSI_FLAG_RXDSIDTNR   = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 10U),      /*!< Rx DSI data type not recognized flag */
    DSI_FLAG_RXDSIVCIDINV = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 11U),     /*!< Rx DSI virtual channel ID invalid flag */
    DSI_FLAG_TXFCTLE    = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 12U),       /*!< Tx False Control Error flag */
    DSI_FLAG_TXECCSE    = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 13U),       /*!< Tx ECC single bit error flag */
    DSI_FLAG_TXECCME    = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 14U),       /*!< Tx ECC multi-bit error flag */
    DSI_FLAG_TXCHKE     = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 15U),       /*!< Tx checksum(CRC) error flag */
    DSI_FLAG_TXDSIDTNR  = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 16U),       /*!< Tx DSI data type not recognized flag */
    DSI_FLAG_TXDSIVCIDINV = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 17U),     /*!< Tx DSI virtual channel ID invalid flag */
    DSI_FLAG_HCONT      = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 18U),       /*!< high contention flag */
    DSI_FLAG_LCONT      = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 19U),       /*!< low contention flag */
    DSI_FLAG_FIFOE      = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 20U),       /*!< FIFO empty flag */
    DSI_FLAG_HSTXTO     = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 21U),       /*!< HS Tx timeout flag */
    DSI_FLAG_LPRXTO     = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 22U),       /*!< LP Rx timeout flag */
    DSI_FLAG_TAACKTO    = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 23U),       /*!< turn around ack timeout flag */
    DSI_FLAG_ACKNE      = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 24U),       /*!< ACK with No error flag */
    DSI_FLAG_RXINVTXCE  = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 25U),       /*!< Rx Invalid transmission count error flag */
    DSI_FLAG_RXDSIPV    = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 26U),       /*!< Rx DSI protocol violation flag */
    DSI_FLAG_SPKTCMDS   = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 27U),       /*!< special packet command sent flag */
    DSI_FLAG_INIT_DONE  = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 28U),       /*!< DSI initialization is done flag */
    DSI_FLAG_RXCONTDET  = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 29U),       /*!< Rx Contention Detected flag */
    DSI_FLAG_DPILTO     = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 30U),       /*!< dpi line timeout flag */
    DSI_FLAG_DPIPE      = DSI_REGIDX_BIT(DSI_INTSTAT0_REG_OFFSET, 31U),       /*!< dpi program error flag */
    /* flags in INTSTAT1 register */
    DSI_FLAG_HSDTFIFOF  = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 0U),        /*!< HS Generic/DCS data FIFO full flag */
    DSI_FLAG_LPDTFIFOF  = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 1U),        /*!< LP Generic/DCS data FIFO full flag */
    DSI_FLAG_LPCTLFIFOF = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 2U),        /*!< LP Generic/DCS control FIFO full flag */
    DSI_FLAG_HSCTLFIFOF = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 3U),        /*!< HS Generic/DCS control FIFO full flag */
    DSI_FLAG_RDDTA      = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 4U),        /*!< LP Generic/DCS read data available flag */
    DSI_FLAG_TETG       = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 5U),        /*!< tearing effect(TE) trigger message received flag */
} dsi_flag_enum;

/* DSI interrupt flags */
typedef enum {
    /* interrupt flags in INTSTAT0 register */
    DSI_INT_FLAG_RXSOTE         = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 0U, DSI_INTSTAT0_REG_OFFSET, 0U),        /*!< Rx Sot Error interrupt flag */
    DSI_INT_FLAG_RXSOTSYNCE     = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 1U, DSI_INTSTAT0_REG_OFFSET, 1U),        /*!< Rx Sot Sync Error interrupt flag */
    DSI_INT_FLAG_RXEOTSYNCE     = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 2U, DSI_INTSTAT0_REG_OFFSET, 2U),        /*!< Rx Eot sync Error interrupt flag */
    DSI_INT_FLAG_RXESCMEE       = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 3U, DSI_INTSTAT0_REG_OFFSET, 3U),        /*!< Rx Escape Mode Entry Error interrupt flag */
    DSI_INT_FLAG_RXLPTXSYNCE    = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 4U, DSI_INTSTAT0_REG_OFFSET, 4U),        /*!< Rx LP tx sync error interrupt flag */
    DSI_INT_FLAG_RXPTOE         = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 5U, DSI_INTSTAT0_REG_OFFSET, 5U),        /*!< Rx Peripheral timeout Error interrupt flag */
    DSI_INT_FLAG_RXFCTLE        = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 6U, DSI_INTSTAT0_REG_OFFSET, 6U),        /*!< RxFalse Control Error interrupt flag */
    DSI_INT_FLAG_RXECCSE        = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 7U, DSI_INTSTAT0_REG_OFFSET, 7U),        /*!< Rx ECC single bit error interrupt flag */
    DSI_INT_FLAG_RXECCME        = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 8U, DSI_INTSTAT0_REG_OFFSET, 8U),        /*!< Rx ECC multi-bit error interrupt flag */
    DSI_INT_FLAG_RXCHKE         = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 9U, DSI_INTSTAT0_REG_OFFSET, 9U),        /*!< Rx checksum error interrupt flag */
    DSI_INT_FLAG_RXDSIDTNR      = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 10U, DSI_INTSTAT0_REG_OFFSET, 10U),      /*!< Rx DSI data type not recognized interrupt flag */
    DSI_INT_FLAG_RXDSIVCIDINV   = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 11U, DSI_INTSTAT0_REG_OFFSET, 11U),      /*!< Rx DSI virtual channel ID invalid interrupt flag */
    DSI_INT_FLAG_TXFCTLE        = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 12U, DSI_INTSTAT0_REG_OFFSET, 12U),      /*!< Tx False Control Error interrupt flag */
    DSI_INT_FLAG_TXECCSE        = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 13U, DSI_INTSTAT0_REG_OFFSET, 13U),      /*!< Tx ECC single bit error interrupt flag */
    DSI_INT_FLAG_TXECCME        = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 14U, DSI_INTSTAT0_REG_OFFSET, 14U),      /*!< Tx ECC multi-bit error interrupt flag */
    DSI_INT_FLAG_TXCHKE         = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 15U, DSI_INTSTAT0_REG_OFFSET, 15U),      /*!< Tx checksum(CRC) error interrupt flag */
    DSI_INT_FLAG_TXDSIDTNR      = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 16U, DSI_INTSTAT0_REG_OFFSET, 16U),      /*!< Tx DSI data type not recognized interrupt flag */
    DSI_INT_FLAG_TXDSIVCIDINV   = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 17U, DSI_INTSTAT0_REG_OFFSET, 17U),      /*!< Tx DSI virtual channel ID invalid interrupt flag */
    DSI_INT_FLAG_HCONT          = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 18U, DSI_INTSTAT0_REG_OFFSET, 18U),      /*!< high contention interrupt flag */
    DSI_INT_FLAG_LCONT          = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 19U, DSI_INTSTAT0_REG_OFFSET, 19U),      /*!< low contention interrupt flag */
    DSI_INT_FLAG_FIFOE          = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 20U, DSI_INTSTAT0_REG_OFFSET, 20U),      /*!< FIFO empty interrupt flag */
    DSI_INT_FLAG_HSTXTO         = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 21U, DSI_INTSTAT0_REG_OFFSET, 21U),      /*!< HS Tx timeout interrupt flag */
    DSI_INT_FLAG_LPRXTO         = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 22U, DSI_INTSTAT0_REG_OFFSET, 22U),      /*!< LP Rx timeout interrupt flag */
    DSI_INT_FLAG_TAACKTO        = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 23U, DSI_INTSTAT0_REG_OFFSET, 23U),      /*!< turn around ack timeout interrupt flag */
    DSI_INT_FLAG_ACKNE          = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 24U, DSI_INTSTAT0_REG_OFFSET, 24U),      /*!< ACK with No error interrupt flag */
    DSI_INT_FLAG_RXINVTXCE      = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 25U, DSI_INTSTAT0_REG_OFFSET, 25U),      /*!< Rx Invalid transmission count error interrupt flag */
    DSI_INT_FLAG_RXDSIPV        = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 26U, DSI_INTSTAT0_REG_OFFSET, 26U),      /*!< Rx DSI protocol violation interrupt flag */
    DSI_INT_FLAG_SPKTCMDS       = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 27U, DSI_INTSTAT0_REG_OFFSET, 27U),      /*!< special packet command sent interrupt flag */
    DSI_INT_FLAG_INIT_DONE      = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 28U, DSI_INTSTAT0_REG_OFFSET, 28U),      /*!< DSI initialization is done interrupt flag */
    DSI_INT_FLAG_RXCONTDET      = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 29U, DSI_INTSTAT0_REG_OFFSET, 29U),      /*!< Rx Contention Detected interrupt flag */
    DSI_INT_FLAG_DPILTO         = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 30U, DSI_INTSTAT0_REG_OFFSET, 30U),      /*!< DPI line timeout interrupt flag */
    DSI_INT_FLAG_DPIPE          = DSI_REGIDX_BIT2(DSI_INTEN_REG_OFFSET, 31U, DSI_INTSTAT0_REG_OFFSET, 31U),      /*!< DPI program error interrupt flag */
    /* flags in INTSTAT1 register */
    DSI_INT_FLAG_HSDTFIFOF      = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 0U),                                   /*!< HS Generic/DCS data FIFO full flag */
    DSI_INT_FLAG_LPDTFIFOF      = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 1U),                                   /*!< LP Generic/DCS data FIFO full flag */
    DSI_INT_FLAG_LPCTLFIFOF     = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 2U),                                   /*!< LP Generic/DCS control FIFO full flag */
    DSI_INT_FLAG_HSCTLFIFOF     = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 3U),                                   /*!< HS Generic/DCS control FIFO full flag */
    DSI_INT_FLAG_RDDTA          = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 4U),                                   /*!< LP Generic/DCS read data available flag */
    DSI_INT_FLAG_TETG           = DSI_REGIDX_BIT(DSI_INTSTAT1_REG_OFFSET, 5U),                                   /*!< tearing effect(TE) trigger message received flag */
} dsi_int_flag_enum;

/* DSI interrupts */
typedef enum {
    /* interrupts in INTEN register */
    DSI_INT_RXSOTE              = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 0U),        /*!< Rx Sot Error interrupt */
    DSI_INT_RXSOTSYNCE          = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 1U),        /*!< Rx Sot Sync Error interrupt */
    DSI_INT_RXEOTSYNCE          = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 2U),        /*!< Rx Eot sync Error interrupt */
    DSI_INT_RXESCMEE            = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 3U),        /*!< Rx Escape Mode Entry Error interrupt */
    DSI_INT_RXLPTXSYNCE         = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 4U),        /*!< Rx LP tx sync error interrupt */
    DSI_INT_RXPTOE              = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 5U),        /*!< Rx Peripheral timeout Error interrupt */
    DSI_INT_RXFCTLE             = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 6U),        /*!< RxFalse Control Error interrupt */
    DSI_INT_RXECCSE             = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 7U),        /*!< Rx ECC single bit error interrupt */
    DSI_INT_RXECCME             = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 8U),        /*!< Rx ECC multi-bit error interrupt */
    DSI_INT_RXCHKE              = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 9U),        /*!< Rx checksum error interrupt */
    DSI_INT_RXDSIDTNR           = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 10U),       /*!< Rx DSI data type not recognized interrupt */
    DSI_INT_RXDSIVCIDINV        = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 11U),       /*!< Rx DSI virtual channel ID invalid interrupt */
    DSI_INT_TXFCTLE             = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 12U),       /*!< Tx False Control Error interrupt */
    DSI_INT_TXECCSE             = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 13U),       /*!< Tx ECC single bit error interrupt */
    DSI_INT_TXECCME             = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 14U),       /*!< Tx ECC multi-bit error interrupt */
    DSI_INT_TXCHKE              = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 15U),       /*!< Tx checksum(CRC) error interrupt */
    DSI_INT_TXDSIDTNR           = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 16U),       /*!< Tx DSI data type not recognized interrupt */
    DSI_INT_TXDSIVCIDINV        = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 17U),       /*!< Tx DSI virtual channel ID invalid interrupt */
    DSI_INT_HCONT               = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 18U),       /*!< high contention interrupt */
    DSI_INT_LCONT               = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 19U),       /*!< low contention interrupt */
    DSI_INT_FIFOE               = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 20U),       /*!< FIFO empty interrupt */
    DSI_INT_HSTXTO              = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 21U),       /*!< HS Tx timeout interrupt */
    DSI_INT_LPRXTO              = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 22U),       /*!< LP Rx timeout interrupt */
    DSI_INT_TAACKTO             = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 23U),       /*!< turn around ack timeout interrupt */
    DSI_INT_ACKNE               = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 24U),       /*!< ACK with No error interrupt */
    DSI_INT_RXINVTXCE           = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 25U),       /*!< Rx Invalid transmission count error interrupt */
    DSI_INT_RXDSIPV             = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 26U),       /*!< Rx DSI protocol violation interrupt */
    DSI_INT_SPKTCMDS            = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 27U),       /*!< special packet command sent interrupt */
    DSI_INT_INIT_DONE           = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 28U),       /*!< DSI initialization is done interrupt */
    DSI_INT_RXCONTDET           = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 29U),       /*!< Rx Contention Detected interrupt */
    DSI_INT_DPILTO              = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 30U),       /*!< DPI line timeout interrupt */
    DSI_INT_DPIPE               = DSI_REGIDX_BIT(DSI_INTEN_REG_OFFSET, 31U),       /*!< DPI program error interrupt */
} dsi_int_enum;

/* DSI wrapper flags */
typedef enum {
    /* flags in WINTSTAT register */
    DSI_FLAG_TE                 = DSI_REGIDX_BIT(DSI_WINTSTAT_REG_OFFSET, 0U),     /*!< tearing effect flag */
    DSI_FLAG_PLL_LOCK           = DSI_REGIDX_BIT(DSI_WINTSTAT_REG_OFFSET, 1U),     /*!< PLL lock flag */
    DSI_FLAG_PLL_UNLOCK         = DSI_REGIDX_BIT(DSI_WINTSTAT_REG_OFFSET, 2U),     /*!< PLL unlock flag */
    DSI_FLAG_PLL_LOCK_STAT      = DSI_REGIDX_BIT(DSI_WINTSTAT_REG_OFFSET, 3U),     /*!< PLL lock status */
    /* flags in WWMS_WCTL register */
    DSI_FLAG_WMS_END            = DSI_REGIDX_BIT(DSI_WWMS_WCTL_REG_OFFSET, 4U)     /*!< write memory split packet end flag */
} dsi_wrapper_flag_enum;

/* DSI wrapper interrupt flags */
typedef enum {
    /* interrupt flags in WINTSTAT register */
    DSI_INT_FLAG_TE             = DSI_REGIDX_BIT(DSI_WINTSTAT_REG_OFFSET, 0U),     /*!< tearing effect flag */
    DSI_INT_FLAG_PLL_LOCK       = DSI_REGIDX_BIT(DSI_WINTSTAT_REG_OFFSET, 1U),     /*!< PLL lock flag */
    DSI_INT_FLAG_PLL_UNLOCK     = DSI_REGIDX_BIT(DSI_WINTSTAT_REG_OFFSET, 2U),     /*!< PLL unlock flag */
    DSI_INT_FLAG_PLL_LOCK_STAT  = DSI_REGIDX_BIT(DSI_WINTSTAT_REG_OFFSET, 3U),     /*!< PLL lock status */
    /* interrupt flags in WWMS_INTMSK register */
    DSI_INT_FLAG_WMS_END        = DSI_REGIDX_BIT(DSI_WWMS_WCTL_REG_OFFSET, 4U)     /*!< write memory split packet end flag */
} dsi_wrapper_int_flag_enum;

/* DSI wrapper interrupt flags */
typedef enum {
    /* interrupt flags in WINTSTAT register */
    DSI_INT_FLAG_TE_CLR         = DSI_REGIDX_BIT(DSI_WINTC_REG_OFFSET, 0U),        /*!< tearing effect flag clear */
    DSI_INT_FLAG_PLL_LOCK_CLR   = DSI_REGIDX_BIT(DSI_WINTC_REG_OFFSET, 1U),        /*!< PLL lock flag clear */
    DSI_INT_FLAG_PLL_UNLOCK_CLR = DSI_REGIDX_BIT(DSI_WINTC_REG_OFFSET, 2U),        /*!< PLL unlock flag clear */
    DSI_INT_FLAG_WMS_END_CLR    = DSI_REGIDX_BIT(DSI_WWMS_WCTL_REG_OFFSET, 4U)     /*!< write memory split packet end flag */
} dsi_wrapper_int_flag_clr_enum;

/* DSI wrapper interrupts */
typedef enum {
    /* interrupts in WINTEN register */
    DSI_INT_TE                  = DSI_REGIDX_BIT(DSI_WINTEN_REG_OFFSET, 0U),       /*!< tearing effect interrupt */
    DSI_INT_PLL_LOCK            = DSI_REGIDX_BIT(DSI_WINTEN_REG_OFFSET, 1U),       /*!< PLL lock interrupt */
    DSI_INT_PLL_UNLOCK          = DSI_REGIDX_BIT(DSI_WINTEN_REG_OFFSET, 2U),       /*!< PLL unlock interrupt */
    DSI_INT_WMS_END_MSK         = DSI_REGIDX_BIT(DSI_WWMS_INTMSK_REG_OFFSET, 4U)   /*!< write memory split packet WMS_END flag interrupt signal mask */
} dsi_wrapper_int_enum;


/* function declarations */
/* DSI deinitialization and initialization functions */
/* deinitialize DSI registers */
void dsi_deinit(void);
/* initialize the DSI_Init structure with the default values */
void dsi_init_struct_para_init(dsi_init_parameter_struct *dsi_init_struct);
/* initialize the DSI host according to the specified parameters in the dsi_init_struct */
void dsi_init(dsi_init_parameter_struct *dsi_init_struct);
/* set the DSI host device ready state */
void dsi_device_ready_set(uint32_t ready_state);
/* set the ULPS state */
void dsi_ulps_mode_set(uint32_t ulps_mode);
/* control display bus possession */
void dsi_display_bus_possession_set(uint32_t bus_pos);
/* configure the DSI low power byte clock */
void dsi_lp_byte_clk_config(uint16_t byte_clk);

/* DSI horizontal and vertical configuration functions */
/* initialize DSI horizontal and vertical count structure with the default values */
void dsi_hv_count_struct_para_init(dsi_hv_count_struct *hv_count);
/* configure the DSI for video mode with complete timing parameters  */
void dsi_hv_count_config(dsi_hv_count_struct *hv_count);
/* configure horizontal sync active count */
void dsi_horizontal_sync_active_count_set(uint16_t count);
/* configure horizontal back porch count */
void dsi_horizontal_back_porch_count_set(uint16_t count);
/* configure horizontal front porch count */
void dsi_horizontal_front_porch_count_set(uint16_t count);
/* configure horizontal active area count */
void dsi_horizontal_active_count_set(uint16_t count);
/* configure vertical sync active count */
void dsi_vertical_sync_active_count_set(uint16_t count);
/* configure vertical back porch count */
void dsi_vertical_back_porch_count_set(uint16_t count);
/* configure vertical front porch count */
void dsi_vertical_front_porch_count_set(uint16_t count);

