RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_dsi.h
/* DSI DPI control functions */
/* enable DSI command is packetized for the DPI’s virtual channel */
void dsi_cmd_pkt_dpi_vchannel_enable(dsi_command_enum cmd);
/* disable DSI command is packetized for the DPI’s virtual channel */
void dsi_cmd_pkt_dpi_vchannel_disable(dsi_command_enum cmd);
/* set DPI resolution */
void dsi_dpi_resolution_set(uint16_t hor_resolution, uint16_t ver_resolution);

/* DSI timeout configuration functions */
/* initialize DSI timing parameters structure with default values */
void dsi_timing_struct_para_init(dsi_timing_parameter_struct *timing_struct);
/* configure all timing parameters */
void dsi_timing_config(dsi_timing_parameter_struct *timing_struct);
/* configure high speed transmission timeout counter */
void dsi_hs_tx_timeout_set(uint32_t timeout);
/* configure low power reception timeout counter */
void dsi_lp_rx_timeout_set(uint32_t timeout);
/* configure turn-around timeout */
void dsi_turnaround_timeout_set(uint8_t timeout);
/* configure device reset timer */
void dsi_device_reset_timer_set(uint16_t timer);

/* DSI function program configuration functions */
/* configure DSI initialization counter */
void dsi_init_counter_set(uint16_t counter);
/* set the number of data lanes */
void dsi_data_lanes_number_set(uint32_t number);
/* set virtual channel for video mode */
void dsi_video_mode_virtual_channel_set(uint32_t virtual_channel);
/* set the video mode format */
void dsi_video_mode_format_set(uint8_t video_mode);
/* set virtual channel for command mode */
void dsi_command_mode_virtual_channel_set(uint32_t virtual_channel);
/* set color format for video mode */
void dsi_video_mode_color_format_set(uint32_t color_format);
/* set data width for command mode */
void dsi_command_mode_data_width_set(uint32_t data_width);
/* configure maximum return packet size and data transfer type */
void dsi_max_return_packet_config(uint16_t hplp, uint16_t size);

/* DSI polarity configuration functions */
/* set DSI polarity */
void dsi_polarity_set(uint32_t polarity);
/* swap DSI polarity to active high */
void dsi_polarity_swap_high(uint32_t polarity);
/* swap DSI polarity to active low */
void dsi_polarity_swap_low(uint32_t polarity);

/* DSI EOT and clock configuration functions */
/* enable EOT packet transmission */
void dsi_eot_transmission_enable(void);
/* disable EOT packet transmission */
void dsi_eot_transmission_disable(void);
/* enable clock stopping feature */
void dsi_clock_stopping_enable(void);
/* disable clock stopping feature */
void dsi_clock_stopping_disable(void);
/* enable video BTA  */
void dsi_video_bta_enable(void);
/* disable video BTA */
void dsi_video_bta_disable(void);

/* DSI data lane and clock lane switching functions */
/* configure HS to LP switching counter for clock lane */
void dsi_clk_hs_to_lp_switch_count_set(uint16_t count);
/* configure LP to HS switching counter for clock lane */
void dsi_clk_lp_to_hs_switch_count_set(uint16_t count);
/* configure data lane switching counter */
void dsi_data_lane_switch_count_set(uint16_t count);

/* DSI DPHY configuration functions */
/* initialize DSI DPHY parameter structure with default values */
void dsi_dphy_struct_para_init(dsi_dphy_parameter_struct *dphy_struct);
/* configure the DPHY parameters */
void dsi_dphy_config(dsi_dphy_parameter_struct *dphy_struct);
/* configure the PLL counter value */
void dsi_dphy_pll_counter_set(uint16_t counter_value);
/* set HS preparation time */
void dsi_dphy_hs_prepare_time_set(uint8_t hs_prepare);
/* set HS zero time */
void dsi_dphy_hs_zero_time_set(uint8_t hs_zero);
/* set HS trail time */
void dsi_dphy_hs_trail_time_set(uint8_t hs_trail);
/* set HS exit time */
void dsi_dphy_hs_exit_time_set(uint8_t hs_exit);
/* set clock preparation time */
void dsi_dphy_clk_prepare_time_set(uint8_t clk_prepare);
/* set clock zero time */
void dsi_dphy_clk_zero_time_set(uint8_t clk_zero);
/* set clock trail time */
void dsi_dphy_clk_trail_time_set(uint8_t clk_trail);
/* set clock exit time */
void dsi_dphy_clk_exit_time_set(uint8_t clk_exit);
/* enable control reset to the digital front end */
void dsi_dphy_dfe_reset_enable(void);
/* disable control reset to the digital front end */
void dsi_dphy_dfe_reset_disable(void);
/* configure DPHY trim settings */
void dsi_dphy_trim_config(uint32_t trim0, uint32_t trim1, uint32_t trim2);

/* DSI DPHY trim functions */
/* set specific DPHY trim control 0 parameter */
void dsi_dphy_trim_control0_set(uint32_t value);
/* set specific DPHY trim control 1 parameter */
void dsi_dphy_trim_control1_set(uint32_t value);
/* set specific DPHY trim control 2 parameter */
void dsi_dphy_trim_control2_set(uint32_t value);

/* DSI deskew configuration functions */
/* enable/disable deskew calibration */
void dsi_deskew_calibration_config(uint32_t state);
/* set deskew duration */
void dsi_deskew_duration_set(uint16_t duration);
/* set deskew periodic timer */
void dsi_deskew_timer_set(uint16_t period);
/* get deskew calibration in progress status */
FlagStatus dsi_deskew_in_progress_status_get(void);

/* DSI error recovery and MIPI direction, DPI status functions */
/* enable error auto recovery options */
void dsi_error_auto_recovery_enable(uint32_t recovery_options);
/* disable error auto recovery options */
void dsi_error_auto_recovery_disable(uint32_t recovery_options);
/* get difference in one line time between DPI and DSI */
uint16_t dsi_dpi_difference_get(void);
/* get DPI line time is greater or DSI line time is greater */
uint32_t dsi_dpi_line_time_status_get(void);
/* get MIPI BUS direction */
uint32_t dsi_mipi_bus_direction_get(void);

/* DSI frequency mode functions */
/* set DDR frequency mode */
void dsi_ddr_freq_mode_set(uint32_t freq_mode);
/* set TX data width */
void dsi_tx_data_width_set(uint8_t width);

/* DSI command mode data functions */
/* set LP control parameters */
void dsi_lp_control_set(uint8_t data_type, uint8_t virtual_channel, uint32_t word_count);
/* set HS control parameters */
void dsi_hs_control_set(uint8_t data_type, uint8_t virtual_channel, uint32_t word_count);
/* write data to LP data register */
void dsi_lp_data_write(uint32_t data);
/* read data to LP data register */
uint32_t dsi_lp_data_read(void);
/* write data to HS data register */
void dsi_hs_data_write(uint32_t data);
/* read data to HS data register */
uint32_t dsi_hs_data_read(void);
/* set DCS word count */
void dsi_dcs_word_count_set(uint16_t count);
/* select high-speed or low-power mode for the next transmission packet */
void dsi_transfer_mode_set(uint32_t mode);

/* DSI wrapper configuration functions */
/* set TE polarity */
void dsi_wrapper_te_polarity_set(uint32_t polarity);
/* enable or disable TLI DMA mode */
void dsi_wrapper_tli_dma_mode_config(uint32_t tli_dma);
/* set TE source */
void dsi_wrapper_te_source_set(uint32_t source);
/* enable or disable automatic refresh mode */
void dsi_wrapper_auto_refresh_mode_config(uint32_t auto_ref_mod);
/* refresh command FIFO buffer */
void dsi_wrapper_cmd_fifo_buffer_refresh(void);
/* enable or disable hardware auto refresh cmd buffer */
void dsi_wrapper_auto_refresh_buffer_config(uint32_t auto_ref_buf);
/* set RGB data format */
void dsi_wrapper_rgb_format_set(uint32_t format);

/* DSI wrapper command mode data source functions */
/* select HS command mode data source */
void dsi_wrapper_hs_cmd_data_source_set(uint32_t source);
/* select LP command mode data source */
void dsi_wrapper_lp_cmd_data_source_set(uint32_t source);

