RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_dsi.h
/* DSI wrapper DMA control functions */
/* select the DMA request source for command mode data */
void dsi_dma_request_source_select(uint32_t source);

/* DSI wrapper WMS configuration functions */
/* initialize DSI WMS structure with default values */
void dsi_wms_struct_para_init(dsi_wms_parameter_struct *wms_struct);
/* configure the DSI wrapper WMS parameters */
void dsi_wms_config(dsi_wms_parameter_struct *wms_struct);
/* enable WMS function */
void dsi_wrapper_wms_enable(void);
/* set WMS mode */
void dsi_wrapper_wms_mode_set(uint32_t mode);
/* check if WMS end flag is set */
FlagStatus dsi_wrapper_wms_end_flag_get(void);
/* mask or unmask the WMS end interrupt */
void dsi_wrapper_wms_end_interrupt_mask(FlagStatus state);
/* set WMS header messages */
void dsi_wrapper_wms_header_set(uint8_t first_header, uint8_t second_header, uint8_t dcs_cmd);
/* set WMS packet length and total length */
void dsi_wrapper_wms_size_set(uint8_t packet_length, uint32_t total_length);
/* get WMS packet number */
uint16_t dsi_wrapper_wms_packet_number_get(void);
/* get WMS sum count */
uint32_t dsi_wrapper_wms_sum_count_get(void);

/* flag and interrupt functions */
/* check the status of specific FIFO */
FlagStatus dsi_fifo_status_get(uint32_t fifo_stat);
/* get DSI specific flag status */
FlagStatus dsi_flag_get(dsi_flag_enum flag);
/* enable DSI specific interrupt */
void dsi_interrupt_enable(dsi_int_enum interrupt);
/* disable DSI specific interrupt */
void dsi_interrupt_disable(dsi_int_enum interrupt);
/* get DSI specific interrupt flag status */
FlagStatus dsi_interrupt_flag_get(dsi_int_flag_enum int_flag);
/* clear DSI specific interrupt flag */
void dsi_interrupt_flag_clear(dsi_int_flag_enum int_flag);
/* get DSI wrapper specific flag status */
FlagStatus dsi_wrapper_flag_get(dsi_wrapper_flag_enum flag);
/* enable DSI wrapper specific interrupt */
void dsi_wrapper_interrupt_enable(dsi_wrapper_int_enum interrupt);
/* disable DSI wrapper specific interrupt */
void dsi_wrapper_interrupt_disable(dsi_wrapper_int_enum interrupt);
/* get DSI wrapper specific interrupt flag status */
FlagStatus dsi_wrapper_interrupt_flag_get(dsi_wrapper_int_flag_enum int_flag);
/* clear DSI wrapper specific interrupt flag  */
void dsi_wrapper_interrupt_flag_clear(dsi_wrapper_int_flag_clr_enum int_flag);

#endif /* GD32H77X_78X_DSI_H */
